Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateX
Coordinates for the X-axel

Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateY
Coordinates for the Y-axel

Tekla.Structures.ModelInternal.dotGrid_t.aCoordinateZ
Coordinates for the Z-axel

Tekla.Structures.ModelInternal.dotGrid_t.aLabelX
Labels for the X-axel

Tekla.Structures.ModelInternal.dotGrid_t.aLabelY
Labels for the Y-axel

Tekla.Structures.ModelInternal.dotGrid_t.aLabelZ
Labels for the Z-axel

Tekla.Structures.ModelInternal.dotGrid_t.Color
Determines the Color of the Grid. This works only in wireframe views.